Revit 2026 API

# ElectricalSystemTrueCurrent Property

---

The TrueCurrent value of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double TrueCurrent { get; }
```
```vb
Public ReadOnly Property TrueCurrent As Double
	Get
```
```cpp
public:
property double TrueCurrent {
	double get ();
}
```
```fsharp
member TrueCurrent : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the TrueCurrent value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace